{"id":1118,"date":"2017-09-05T08:43:14","date_gmt":"2017-09-05T12:43:14","guid":{"rendered":"https:\/\/wp.nyu.edu\/library-drsr\/?p=104"},"modified":"2017-09-06T14:10:36","modified_gmt":"2017-09-06T18:10:36","slug":"fall-2017-update-on-research-storage-project","status":"publish","type":"post","link":"https:\/\/data-services.hosting.nyu.edu\/fall-2017-update-on-research-storage-project\/","title":{"rendered":"Fall 2017 Update on Research Storage Project"},"content":{"rendered":"<p><strong>STATUS REPORT: Maturing Research Data Storage Infrastructure Services <\/strong><br \/>\n<em>High quality infrastructure services enable scholars to focus on the research work itself<\/em><\/p>\n<p>NYU’s commitment to growth as a research institution coupled with the growing data needs in the research process drives the need to deliver strong services and support for storing and managing digital content within and between each stage of the Research Data Lifecycle.<\/p>\n<p>The <em>Research Data Lifecycle<\/em> is a series of sequentially related stages or phases in which information is produced, processed and shared. In recent years, the amount of information has been growing exponentially.<\/p>\n<p><img class=\" wp-image-106 alignleft\" src=\"https:\/\/18798-presscdn-pagely.netdna-ssl.com\/library-drsr\/wp-content\/uploads\/sites\/3651\/2017\/08\/research-life-cycle-final-300x275.png\" alt=\"\" width=\"371\" height=\"340\" srcset=\"https:\/\/18798-presscdn-pagely.netdna-ssl.com\/library-drsr\/wp-content\/uploads\/sites\/3651\/2017\/08\/research-life-cycle-final-300x275.png 300w, https:\/\/18798-presscdn-pagely.netdna-ssl.com\/library-drsr\/wp-content\/uploads\/sites\/3651\/2017\/08\/research-life-cycle-final-1x1.png 1w, https:\/\/18798-presscdn-pagely.netdna-ssl.com\/library-drsr\/wp-content\/uploads\/sites\/3651\/2017\/08\/research-life-cycle-final.png 612w\" sizes=\"(max-width: 371px) 100vw, 371px\" \/><\/p>\n<p>The lines between circles represent the transitions that occur in research as work is finished and passed to the next stage. It is critical for a research institution such as NYU to support each stage of the lifecycle and to facilitate the smooth transition between stages for maximum use and impact.<\/p>\n<p>In 2014, NYU IT and NYU Libraries teamed up to take a holistic view of the Research Data Lifecycle in order to consider services and environments that are interconnected and that would benefit everyone involved in these facets of research.<\/p>\n<p>Last year we began planning for new infrastructure to support researchers’ needs. In particular, we delineated two areas of focus, Both of which would likely be comprised of multiple components, applications, or layers:<\/p>\n<ol>\n<li><strong>A dynamic storage environment that allows for easy and fast access, sharing, and workflow management tasks.<\/strong><\/li>\n<li><strong>A publication environment that allows for deposit of finished digital content with persistent links, preservation, and discovery and access controls.<\/strong><\/li>\n<\/ol>\n<p>In Fall 2016 we began designing and building out pilots for both these areas. To facilitate that work, we brought on board storage architecture specialists, research data management librarians, application developers, and repository specialists from across our two organizations.<\/p>\n<p>This year, to address dynamic workspace needs, we put into production the <a href=\"https:\/\/osf.nyu.edu\/\"><em>Open Science Framework for Institutions (OSF)<\/em><\/a> software which allows for easy groups and research workflow management and connects to existing NYU storage options like NYU Drive (Google) and NYU Box, and to many other standard storage platforms.<\/p>\n<p>To enhance underlying infrastructure options, we are now piloting a large storage system that is mountable from computers on the NYU network. This storage system allows researchers to access, manipulate, and analyze data from a large external drive with performance similar to their own desktop. The soft launch of the production version is expected to roll-out in Fall 2017 on new robust NetApp hardware. Researchers will get free access to 2TB of space, with a competitive cost structure for purchasing more. In addition, development will continue on integrating OSF with our new storage hardware, on creating more web accessibility for the storage, and on creating more and better publication repository options.<\/p>\n<p>For the publication environment, we have made improvements to existing repository offerings like the Faculty Digital Archive, enhancing the user interface and metadata authoring capabilities. We have also used the parallel development of the new Spatial Data Repository as a use case for future development of other static preservation needs. Lastly, the OSF is giving users new ways to publish their work out by minting static Digital Object Identifiers (DOIs) at a project’s end.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>STATUS REPORT: Maturing Research Data Storage Infrastructure Services&nbsp; High quality infrastructure services enable scholars to focus on the research work itself NYU&rsquo;s commitment to growth as a research institution coupled with the growing data needs in the research process drives the need to deliver strong services and support for storing and managing digital content within&#8230;<\/p>\n","protected":false},"author":18,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[8],"tags":[],"_links":{"self":[{"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/posts\/1118"}],"collection":[{"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/comments?post=1118"}],"version-history":[{"count":2,"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/posts\/1118\/revisions"}],"predecessor-version":[{"id":1233,"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/posts\/1118\/revisions\/1233"}],"wp:attachment":[{"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/media?parent=1118"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/categories?post=1118"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/data-services.hosting.nyu.edu\/wp-json\/wp\/v2\/tags?post=1118"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}